#63
##def f(n):
##    if n <= 13:
##        return n**3 + n**2 + 1
##    elif n % 3 == 0:
##        return f(n-1) + 2 * n**2 - 3
##    return f(n - 2) + 3* n + 6
##
##a = 0 #количество натуральных значений n
##for x in range(1, 1001):
##    t = list(str(f(x)))
##    k = 0
##    for m in t:
##        if m in ['1','3','5','7','9']: 
##            k += 1 # считаем нечётные цифры
##    if k == len(t):#если насчитали столько же
##        a += 1      #если насчитали столько же
##print(a)            #сколько длина списка из этого числа 
#******************************************************************
#184
import sys

sys.setrecursionlimit(10000)

def F( n ):
  return n if n < 11 else n + F(n-1)

print( F(2024) - F(2021) )





